<template lang="pug">
InnerPageContainer
  h1 Политика конфиденциальности
  ._typography
    p Сайт dnkcode.com принадлежит ФОП Кравченко Е.Н., которая является контроллером для ваших личных данных.
    p Мы используем эту Политику конфиденциальности, которая определяет, как мы обрабатываем информацию, собранную dnkcode.com, а также причины, по которым мы должны собирать определённые личные данные о вас. Поэтому вы должны прочитать данную Политику конфиденциальности перед использованием сайта dnkcode.com.
    p Мы заботимся о ваших личных данных и гарантируем их конфиденциальность и безопасность.
    h3 Личная информация, которую мы собираем:
    p при посещении dnkcode.com, мы можем собирать личные данные, которые вы нам предоставляете (имя, фамилию, номер телефона, адрес электронной почты) во время регистрации, чтобы иметь возможность выполнить соглашение.
    h3 Почему мы обрабатываем ваши данные?
    p Нашим главным приоритетом является безопасность клиентов, вот почему мы должны обрабатывать тот минимальный объем пользовательских данных: ровно столько, сколько необходимо для обслуживания сайта. Информация, собираемая автоматически, используется только для выявления потенциальных нарушений и получения статистической информации об использовании Сайта. Эта статистическая информация не собирается таким образом, чтобы можно было идентифицировать конкретного пользователя системы.
    p Вы можете посещать Сайт, не сообщая нам, кто вы, и не раскрывая никакой информации, с помощью которой кто-либо мог бы идентифицировать вас как конкретное лицо. Однако, если вы хотите использовать некоторые функции сайта, хотите получать нашу рассылку новостей или другие сведения, заполнив форму, — вы можете предоставить нам личные данные, такие как ваш адрес электронной почты, имя, фамилия, номер телефона. Вы можете не предоставлять нам свои личные данные, но в этом случае вы не сможете воспользоваться определёнными функциями Сайта. Например, вы не сможете получать нашу рассылку новостей или связываться с нами напрямую через Сайт. Пользователи, которые не уверены, какая информация является обязательной, могут связаться с нами через help.dnkcode@gmail.com.
    h3 Ссылки на другие сайты:
    p Наш Сайт может содержать ссылки на другие сайты, которые нам не принадлежат и не контролируются нами. Имейте в виду, что мы не несем ответственности за политику конфиденциальности подобных сайтов или третьих лиц. Мы рекомендуем вам проверять, когда вы покидаете наш Сайт и читаете заявления о конфиденциальности каждого сайта, который может собирать личную информацию.
    h3 Информационная безопасность:
    p Мы защищаем информацию, которую вы предоставляете на компьютерных серверах, в контролируемой безопасной среде, защищенной от несанкционированного доступа, использования или раскрытия. Мы принимаем разумные административные, технические и физические меры безопасности для защиты от несанкционированного доступа, использования, изменения и раскрытия личных данных, находящихся под его контролем и хранением. Однако передача данных через Интернет или беспроводную сеть не может быть гарантирована.
    h3 Контактная информация:
    p Если вы хотите связаться с нами, чтобы узнать больше об этой Политике, или хотите связаться с нами по любому вопросу, касающемуся индивидуальных прав и вашей Личной информации, вы можете отправить письмо на адрес help.dnkcode@gmail.com.
</template>

<script lang="ts">
import InnerPageContainer from '@/components/app/InnerPageContainer.vue';
import Stars from '@/components/app/Stars.vue';
import {defineComponent} from 'vue';

export default defineComponent({
  components: {
    InnerPageContainer,
    Stars
  }
});
</script>

<style scoped>
._typography h3 {
  margin-top: 50px;
}
</style>